rick3rt/ESP8266exOLED/include/displayFunctions.h
#ifndef DISPLAYFUNCTIONS_H
#define DISPLAYFUNCTIONS_H

#include <Arduino.h>
#include <Adafruit_GFX.h>

#include <Adafruit_SSD1306.h>
#include <Fonts/FreeSerifBoldItalic12pt7b.h>
#include <ESP8266TrueRandom.h>
#include "names.h"

// Config for the SSD1306 screen
#define SCREEN_WIDTH 128 // OLED display width, in pixels
#define SCREEN_HEIGHT 64 // OLED display heig1ht, in pixels
#define OLED_RESET -1    // Reset pin # (or -1 if sharing Arduino reset pin)
#define DRAW_BOOT_LOGO 0 // Draw a logo on boot or skip
// #if DRAW_BOOT_LOGO
// #include "splash_chip.h"
// #endif

// Definition for an SSD1306 display connected to I2C (SDA, SCL pins)
// make sure extern since this is external header file
extern Adafruit_SSD1306 display;
// extern Adafruit_SSD1306 display(SCREEN_WIDTH, SCREEN_HEIGHT, &Wire, OLED_RESET);

// some constants for animation
#define NUMFLAKES 10 // Number of snowflakes in the animation example
#define LOGO_HEIGHT 16
#define LOGO_WIDTH 16

// a logo
static const unsigned char PROGMEM logo_bmp[] =
    {B00000000, B11000000,
     B00000001, B11000000,
     B00000001, B11000000,
     B00000011, B11100000,
     B11110011, B11100000,
     B11111110, B11111000,
     B01111110, B11111111,
     B00110011, B10011111,
     B00011111, B11111100,
     B00001101, B01110000,
     B00011011, B10100000,
     B00111111, B11100000,
     B00111111, B11110000,
     B01111100, B11110000,
     B01110000, B01110000,
     B00000000, B00110000};

// =============================================================================
// FUNCTION DECLARATIONS
// =============================================================================
// void InitDisplay(byte addess = 0x3C);
void InitDisplay();

struct mysize
{
    int w, h;
};

void scrollBitmap(int dir, mysize (*funToDraw)(int x, int y));

void animateNames(const char name_arr[][NUM_CHARS], const int name_inds_og[],
                  const int num_names, char const postfix[] = "",
                  int textSize = 1, int delayms = 20);
void whosNextAnimate();
void swap(int *a, int *b);
void randomize(int arr[], int n);
String convertToString(const char *a, int size);

void AnimateAllBlink();
void AnimateAllStick();

// -----------------------------------------------------------------------------
// test draw functions
// -----------------------------------------------------------------------------
/*
void testdrawline();
void testdrawrect(void);
void testfillrect(void);
void testdrawcircle(void);
void testfillcircle(void);
void testdrawroundrect(void);
void testfillroundrect(void);
void testdrawtriangle(void);
void testfilltriangle(void);
void testdrawchar(void);
void testdrawstyles(void);
void testscrolltext(void);
void testdrawbitmap(void);
void testanimate(const uint8_t *bitmap, uint8_t w, uint8_t h);
*/

#endif
